stamhoffman/tool_box_stm32/stm_lib/src/tht11.c
#include <stm32f10x_conf.h>

void start_data_read(void) {
  DHTPORT->CRH = 0x84444444;
  DHTPORT->IDR = 0x00006000;
  delay_ms(18); //Запрос данных, подтяжка к нулю
  DHTPORT->CRH = 0x44444444;
  DHTPORT->IDR = 0x0000e000;
  delay_us(8); //Ждем ответа от абонента
}

void received_data(void) {

  int bit;

  while ((DHTPORT->IDR) & (DHTPIN));
  delay_us(150);
  while ((DHTPORT->IDR) & (DHTPIN));

  for (bit = 0; bit < 40; bit++) {
    while (!((DHTPORT->IDR) & (DHTPIN)));
   delay_us(40);

    if ((DHTPORT->IDR &DHTPIN)) {
      data[bit] = 1;
      while (((DHTPORT->IDR) & (DHTPIN)));
      continue;
    } else {
      data[bit] = 0;
      continue;
    }
  }
delay_us(54);
}

void pack_data(void) {
  int count;

  dht_data.RH_data_decimal = 0;

  for (count = 7; count >= 0; count--) {
    dht_data.RH_data_decimal =
        (dht_data.RH_data_decimal) | ((data[count]) << (7 - count));
  }

  dht_data.RH_data_integral = 0;

  for (count = 15; count >= 8; count--) {
    dht_data.RH_data_integral =
        (dht_data.RH_data_integral) | ((data[count]) << (15 - count));
  }

  dht_data.T_data_decimal = 0;

  for (count = 23; count >= 16; count--) {
    dht_data.T_data_decimal =
        (dht_data.T_data_decimal) | ((data[count]) << (23 - count));
  }

  dht_data.T_data_integral = 0;

  for (count = 31; count >= 24; count--) {
    dht_data.T_data_integral =
        (dht_data.T_data_integral) | ((data[count]) << (31 - count));
  }
}
